actions/user/UserDetail.php

	public function execute()
	{

		$showRecord = MessageEnum::$access[MessageEnum::NoRecord];
		$model_class = Yii::$app->controller->modelClass;
		// This is how you get header params request and respectivly their value
		$requestData 	=   Yii::$app->getRequest()->getHeaders()->get('userId');
		$model = new $model_class();

		$data = $model->find()
				->where(['id' => $requestData])
				->with(['store','region','brand','access'])
				->asArray()
				->one();
---
SELECT * FROM `user_access` WHERE `id`='1'